In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os, io
import numpy as np
from pandas import Series, DataFrame, read_table
import warnings
warnings.filterwarnings('ignore')
from sklearn.metrics import mean_squared_error
%matplotlib inline

# Data Analysis and Exploration

## User Data

In [3]:
df_users = pd.read_csv("BX-Users.csv", delimiter=",", encoding="latin-1")
df_users.head()

  user_id                            Location   Age
0       1                  nyc, new york, usa   NaN
1       2           stockton, california, usa  18.0
2       3     moscow, yukon territory, russia   NaN
3       4           porto, v.n.gaia, portugal  17.0
4       5  farnborough, hants, united kingdom   NaN

### Data Exploration

In [5]:
print("---Info for dataset:Users---")
print(df_users.info())

---Info for dataset:Users---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278859 entries, 0 to 278858
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   278859 non-null  object
 1   Location  278858 non-null  object
 2   Age       168096 non-null  float64
dtypes: float64(1), object(2)
memory usage: 6.4+ MB
None

In [6]:
print("---Nulls for dataset:Users---")
print(df_users.isnull().sum())

---Nulls for dataset:Users---
user_id          0
Location         1
Age         110763
dtype: int64

In [10]:
# print the number of unique users
print("Number of unique users:", df_users["user_id"].nunique())

Number of unique users: 278859

### Data NaN & Nulls

In [12]:
df_users = df_users.dropna()

In [13]:
print("Size of Users dataframe:", df_users.shape)

Size of Users dataframe: (168096, 3)

### Data Type Convertions

In [14]:
df_users["user_id"] = pd.to_numeric(df_users["user_id"], errors="coerce")
# df_users["user_id"] = df_users["user_id"].astype(int)
df_users.head()

    user_id                        Location   Age
1         2       stockton, california, usa  18.0
3         4       porto, v.n.gaia, portugal  17.0
5         6   santa monica, california, usa  61.0
9        10      albacete, wisconsin, spain  26.0
10       11  melbourne, victoria, australia  14.0

In [15]:
df_users = df_users.sort_values(by=["user_id"])
df_users.head()

    user_id                        Location   Age
1         2       stockton, california, usa  18.0
3         4       porto, v.n.gaia, portugal  17.0
5         6   santa monica, california, usa  61.0
9        10      albacete, wisconsin, spain  26.0
10       11  melbourne, victoria, australia  14.0

In [16]:
# Reset the index of the dataframe
df_users.reset_index(drop=True, inplace=True)
df_users.head()

   user_id                        Location   Age
0        2       stockton, california, usa  18.0
1        4       porto, v.n.gaia, portugal  17.0
2        6   santa monica, california, usa  61.0
3       10      albacete, wisconsin, spain  26.0
4       11  melbourne, victoria, australia  14.0

## Book Data

In [35]:
df_books = pd.read_csv("BX-Books.csv", delimiter=",", encoding="latin-1")
df_books.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

### Data Exploration

In [36]:
print("---Info for dataset:Books---")
print(df_books.info())

---Info for dataset:Books---
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271379 entries, 0 to 271378
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   isbn                 271379 non-null  object
 1   book_title           271379 non-null  object
 2   book_author          271377 non-null  object
 3   year_of_publication  271379 non-null  object
 4   publisher            271377 non-null  object
dtypes: object(5)
memory usage: 10.4+ MB
None

In [54]:
print("---Nulls for dataset:Books---")
print(df_books.isnull().sum())

---Nulls for dataset:Books---
isbn                   0
book_title             0
book_author            2
year_of_publication    0
publisher              2
dtype: int64

In [55]:
nunique_books = df_books["isbn"].nunique()
print(f"Number of unique_books: {nunique_books}")

Number of unique_books: 271379

### Data NaN or Nulls

In [27]:
df_books = df_books.dropna()

### Data Type Convertion

In [32]:
df_books["isbn"] = df_books["isbn"].astype("str", errors="ignore")
df_books = df_books.sort_values(by=["isbn"])
df_books.reset_index(drop=True, inplace=True)

In [33]:
print(df_books.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271379 entries, 0 to 271378
Data columns (total 5 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   isbn                 271379 non-null  object
 1   book_title           271379 non-null  object
 2   book_author          271377 non-null  object
 3   year_of_publication  271379 non-null  object
 4   publisher            271377 non-null  object
dtypes: object(5)
memory usage: 10.4+ MB
None

In [29]:
df_books.head()

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company

## Ratings Data

In [3]:
df_ratings = pd.read_csv("BX-Book-Ratings.csv", delimiter=",", encoding="latin-1")

### Data Exploration

In [4]:
df_ratings.head()

   user_id        isbn  rating
0   276725  034545104X       0
1   276726   155061224       5
2   276727   446520802       0
3   276729  052165615X       3
4   276729   521795028       6

In [5]:
print(df_ratings.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column   Non-Null Count    Dtype
---  ------   --------------    -----
 0   user_id  1048575 non-null  int64
 1   isbn     1048575 non-null  object
 2   rating   1048575 non-null  int64
dtypes: int64(2), object(1)
memory usage: 24.0+ MB
None

In [5]:
print("Unique number of user_id and isbn in Book Ratings dataframe")
nunique_rating_user_id = df_ratings["user_id"].nunique()
print(f"Unique number of user_id: {nunique_rating_user_id}")

unique_rating_isbn = df_ratings["isbn"].nunique()
print(f"Unique number of isbn: {unique_rating_isbn}")

Unique number of user_id and isbn in Book Ratings dataframe
Unique number of user_id: 95513
Unique number of isbn: 322102

In [6]:
print(df_ratings.isnull().sum())

user_id    0
isbn       0
rating     0
dtype: int64

In [7]:
df_ratings.isnull().any()

user_id    False
isbn       False
rating     False
dtype: bool

### Data Type Convertion

In [23]:
df_ratings["isbn"] = pd.to_numeric(df_ratings["isbn"], errors="coerce")

In [24]:
df_ratings["isbn"] = df_ratings["isbn"].astype("int64")

In [25]:
print(df_ratings.isnull().sum())

user_id    0
isbn       0
rating     0
dtype: int64

In [26]:
df_ratings = df_ratings.dropna()

In [27]:
df_ratings.isnull().any()

user_id    False
isbn       False
rating     False
dtype: bool

In [28]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
Index: 960865 entries, 14 to 1047551
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   user_id  960865 non-null  int64
 1   isbn     960865 non-null  int64
 2   rating   960865 non-null  int64
dtypes: int64(3)
memory usage: 29.3 MB

In [29]:
df_ratings = df_ratings.sort_values(by=["isbn"])
df_ratings.reset_index(drop=True, inplace=True)
df_ratings.head()

   user_id  isbn  rating
0     8094     0       0
1    55488     0       0
2   214319     0       0
3   179624     0       0
4   120548     0       0

In [30]:
print(df_ratings.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 960865 entries, 0 to 960864
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   user_id  960865 non-null  int64
 1   isbn     960865 non-null  int64
 2   rating   960865 non-null  int64
dtypes: int64(3)
memory usage: 22.0 MB
None

In [31]:
print("---Nulls for dataset:Ratings---")
print(df_ratings.isnull().sum())

---Nulls for dataset:Ratings---
user_id    0
isbn       0
rating     0
dtype: int64

In [34]:
df_ratings.head()

   user_id  isbn  rating
0     8094     0       0
1    55488     0       0
2   214319     0       0
3   179624     0       0
4   120548     0       0

In [35]:
# Create a mapping of user_id to its corresponding index
user_id_idx_map = {user: i for i, user in enumerate(df_ratings["user_id"].unique())}

In [36]:
df_ratings["user_id_idx"] = df_ratings["user_id"].map(user_id_idx_map)
df_ratings.head()

   user_id  isbn  rating  user_id_idx
0     8094     0       0            0
1    55488     0       0            1
2   214319     0       0            2
3   179624     0       0            3
4   120548     0       0            4

In [37]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 960865 entries, 0 to 960864
Data columns (total 4 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      960865 non-null  int64
 1   isbn         960865 non-null  int64
 2   rating       960865 non-null  int64
 3   user_id_idx  960865 non-null  int64
dtypes: int64(4)
memory usage: 29.3 MB

In [41]:
isbn_idx_map = {isbn: i for i, isbn in enumerate(df_ratings["isbn"].unique())}
print(len(isbn_idx_map))

294407

In [39]:
df_ratings["isbn_idx"] = df_ratings["isbn"].map(isbn_idx_map)
df_ratings.head()

   user_id  isbn  rating  user_id_idx  isbn_idx
0     8094     0       0            0         0
1    55488     0       0            1         0
2   214319     0       0            2         0
3   179624     0       0            3         0
4   120548     0       0            4         0

In [42]:
# Create a mapping of user_id to its corresponding index
user_id_idx_map = {user: i for i, user in enumerate(df_ratings["user_id"].unique())}

In [ ]:
df_ratings.drop(["isbn", "user_id"], axis=1, inplace=True)

In [19]:
# Re-index the columns of the ratings dataframe
ratings_matrix = df_ratings.pivot_table(
    index="user_id_idx", columns="isbn_idx", values="rating"
).fillna(0)

:

In [56]:
ratings_matrix.head()

isbn,0.000000e+00,3.302417e-01,5.533900e-01,7.002800e-01,2.253000e+00,2.253034e+00,2.714419e+00,3.406421e+00,3.442443e+00,3.453119e+00,...,9.320000e+12,9.710000e+12,9.730000e+12,9.770000e+12,9.780000e+12,9.790000e+12,9.800000e+12,9.900000e+12,9.980000e+12,1.000000e+13
user_id,,,,,,,,,,,,,,,,,,,,,
8,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
10,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
12,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
14,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [59]:
from sklearn.model_selection import train_test_split

# Split the ratings matrix into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(
    ratings_matrix.index, ratings_matrix.values, test_size=0.25
)